Обработки/Reports/_РасчетСтоимостиДепозитаПоНастройкамСчетаДУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасчетСтоимостиДепозитаПоНастройкамСчетаДУ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасчетСтоимостиДепозитаПоНастройкамСчетаДУ/Ext/ObjectModule.bsl
#Область Интерфейс_внешней_обработки

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Расчет стоимости депозита по настройкам счета ДУ",
		"0.13",
		"",
		Истина
	);
		
	// Команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции
#КонецОбласти

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "НаДату,ЦельРасчета,СчетДоверительногоУправления");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	СтандартнаяОбработка = Ложь;
	
	Макет = ПолучитьМакет("РасшифровкаРасчетаСтоимостиДепозита");
	
	ОбластьСчетДоверительногоУправления = Макет.ПолучитьОбласть("СчетДоверительногоУправления");
	
	ОбластьСчетДоверительногоУправления.Параметры.СчетДоверительногоУправления = СчетДоверительногоУправления;
	ОбластьСчетДоверительногоУправления.Параметры.НаДату = Формат(НаДату, "ДФ=dd.MM.yy");
	
	ДокументРезультат.Вывести(ОбластьСчетДоверительногоУправления);
	
	
	ОбластьДепозит = Макет.ПолучитьОбласть("Депозит");
	
	Депозиты = РаботаСКредитнымиИнструментами.ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправленияПоРыночнойСтавкеСУчетомПериодичностиОценки(
		СчетДоверительногоУправления, 
		КонецДня(НаДату), 
		ЦельРасчета, 
		Перечисления.ТипыКредитныхИнструментов.ДепозитныйВклад);
	
	Для Каждого СтрокаДепозиты Из Депозиты Цикл
		
		Если СтрокаДепозиты.ВариантОтклоненияОтРыночнойСтавки = Перечисления.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.КриваяБезрисковойДоходности Тогда
			ОбластьДепозит = Макет.ПолучитьОбласть("ДепозитКБД");
			
			ОбластьДепозит.Параметры.ПроцентМинимум		= Окр(СтрокаДепозиты.БезрисковаяСтавкаДоходности +	СтрокаДепозиты.МинимумКредитногоСпреда	/ 100, СтрокаДепозиты.ТочностьРыночнойСтавки);
			ОбластьДепозит.Параметры.ПроцентМедиана		= Окр(СтрокаДепозиты.БезрисковаяСтавкаДоходности +	СтрокаДепозиты.Медиана 					/ 100, СтрокаДепозиты.ТочностьРыночнойСтавки);
			ОбластьДепозит.Параметры.ПроцентМаксимум	= Окр(СтрокаДепозиты.БезрисковаяСтавкаДоходности +	СтрокаДепозиты.МаксимумКредитногоСпреда / 100, СтрокаДепозиты.ТочностьРыночнойСтавки);
			
			ЗаполнитьЗначенияСвойств(ОбластьДепозит.Параметры, СтрокаДепозиты,, "ПроцентПоКредитномуИнструменту,Проценты");
			
		Иначе
			ОбластьДепозит = Макет.ПолучитьОбласть("Депозит");
		
			ОбластьДепозит.Параметры.СреднерыночнаяСтавкаНаДатуРасчета	= Окр(СтрокаДепозиты.СреднерыночнаяСтавка	, СтрокаДепозиты.ТочностьРыночнойСтавки);
			ОбластьДепозит.Параметры.ВерхняяГраницаСреднерыночнойСтавки = Окр(СтрокаДепозиты.ВерхняяГраницаСреднерыночнойСтавки	, СтрокаДепозиты.ТочностьРыночнойСтавки);
			ОбластьДепозит.Параметры.НижняяГраницаСреднерыночнойСтавки	= Окр(СтрокаДепозиты.НижняяГраницаСреднерыночнойСтавки	, СтрокаДепозиты.ТочностьРыночнойСтавки);
			
			ОбластьДепозит.Параметры.ДатаСреднерыночнойСтавки = Формат(СтрокаДепозиты.ПериодСреднерыночнойСтавки, "ДФ=dd.MM.yy");
		
			ЗаполнитьЗначенияСвойств(ОбластьДепозит.Параметры, СтрокаДепозиты,, "ПроцентПоКредитномуИнструменту,Проценты");
		КонецЕсли;
		
		ОбластьДепозит.Параметры.ПроцентПоКредитномуИнструменту	= Окр(СтрокаДепозиты.ПроцентПоКредитномуИнструменту	, СтрокаДепозиты.ТочностьРыночнойСтавки);
		ОбластьДепозит.Параметры.ПроцентыЛинейено	= СтрокаДепозиты.Проценты;
		ОбластьДепозит.Параметры.КорректировкаЭСП	= СтрокаДепозиты.ПроцентыЭСП;
		ОбластьДепозит.Параметры.Проценты			= СтрокаДепозиты.Проценты + СтрокаДепозиты.ПроцентыЭСП;
		
		
		ДокументРезультат.Вывести(ОбластьДепозит);
		
	КонецЦикла;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры
